#include <iostream>
#include <vector>

using namespace std;

void div_30()
{
    /**
     1) считать число 
     2) добавить его к одному из счетчиков соответсвующего класса эквивалетности: 
     делится на 30
     делится на 2 НЕ на 3, 5, 6, 15
     делится на 3 НЕ на 2, 5, 6, 15
     делится на 5 НЕ на 2, 3, 6, 15
     делится на 6 НЕ на 2, 3, 5, 15
     делится на 15 НЕ на 2, 3, 5, 6
     не делится ни на 2, ни на 3, ни на 5, ни на 6, ни на 15
     3) ответ: n30 * n2 + n30 * n3 + n30 * n5 + n30 * n6 + n30 * n15 + n30 * no + n30 * (n30 - 1)/2 + n2*n15 + n2*
    */ 
}

int main()
{
    div_30();
    return 0;
}