#include <iostream>
#include <vector>
using namespace std;

void num_sum_min_distance_eff_2318_2()
{
    /**
ЦИКЛИЧЕСКИЙ БУФЕР
1) считываем первые 6 чисел в червяка (6 - расстояние между числами >=)
2) далее в цикле от 6 до n:
    а) выкидываем число из хвоста, закидываем аток от деления на 33 вышедшего из хвоста числа в счетчик
    б) вводим новую голову и смотрим с чем комплиментарен остаток от деления головы на 33, закидываем этот счетчик в глобальный
3) выводим глобальный счетчик

    **/
}

int main()
{
    num_sum_min_distance_eff_2318_2();
    return 0;
}
