#include <iostream>
#include <vector>

using namespace std;

void div_110()
{
    /**
     1) считать число 
     2) добавить его к одному из счетчиков соответсвующего класса эквивалетности: 
     делится на 110
     делится на 2 НЕ на 5, 10, 11, 22, 55
     делится на 5 НЕ на 2, 10, 11, 22, 55
     делится на 10 НЕ на 2, 5, 11, 22, 55
     делится на 11 НЕ на 2, 5, 10, 22, 55
     делится на 22 НЕ на 2, 5, 10, 11, 55
     делится на 55 НЕ на 2, 5, 10, 11, 22
     не делится ни на 2,  ни на 5,  ни на 10, 1ни на 1, ни на 22, ни на 55
     3) ответ: n110 * no + n110 * n2 + n110 * n5 + n110 * n10 + n110 * n11 + n110 * n22 + n110 * n55 + n110 * (n110 - 1) / 2 + n2 * n55 + n5 * n22 + n10 * (n11 + n22 + n55)
    */ 


   int n110(0), n0(0), n2(0), n5(0), n10(0), n11(0), n22(0), n55(0);
   int n, cur;
    cin >> n;
    for (int i = 0; i<n; i++)
    {
        cin >> cur;
        if (cur % 110 == 0) 
           n110++;
        else if (cur % 55 == 0) 
            n55++;
        else if (cur % 22 == 0) 
            n22++;
        else if (cur % 11 == 0) 
            n11++;
        else if (cur % 10 == 0) 
            n10++;
        else if (cur % 5 == 0) 
            n5++;
        else if (cur % 2 ==0)
            n2++;
    }

    n0 = n - n110 - n55 - n22 - n11 - n10 - n5 - n2;
    cout << n110 * n0 + n110 * n2 + n110 * n5 + n110 * n10 + n110 * n11 + n110 * n22 + n110 * n55 + n110 * (n110 - 1) / 2 + n55 * (n2 + n10 + n22) + n22 * (n5 + n10) + n11 * n10;
}

int main()
{
    div_110();
    return 0;
}
