#include <iostream>
#include <vector>
using namespace std;

void min_sum_distance_eff()
{
    /**
    +1) считать 4 числа в червяка
    +2) число в хвосте червяка - потенциальный минимум из пройденных
    3) сдвинуть все числа в червяке влево (0123 -> 1234)
    4) счиатт пятое число в зубы червяку
    5) ВЫВЕСТИ ЧЕРВЯКА И ПРОЙДЕННЫЙ МИНИМУМ ДЛЯ ПРОВЕРКИ
    6) собоать пару из того, что в зубах червяка, и пройденного минимума
    7) это кандидат на минимульаную пару
    8) один ход червяка закончен, повторяем
    **/

    int n, probably_min = 9999;
    cin >> n;
    vector<int> vector_num(4, 0); //4 потому что это дистанция между нашими числами
    for (int i(0); i < 4; i++)
        cin >> vector_num[i];

}

int main()
{
    min_sum_distance_eff();
    return 0;
}
